In [22]:
import pandas as pd
from pandas import DataFrame, Series
import numpy

# 创建 DataFrame

In [19]:
data = {
    'Country':['USA', 'Spain', 'Italy', 'Germany'],
    'Confirmed':[1020730, 212917, 201505, 157641]
    }

In [20]:
df1 = DataFrame(data)
df1

   Country  Confirmed
0      USA    1020730
1    Spain     212917
2    Italy     201505
3  Germany     157641

In [36]:
s1 = Series(data['Country'])
s2 = Series(data['Confirmed'])
s1,s2

(0        USA
 1      Spain
 2      Italy
 3    Germany
 dtype: object,
 0    1020730
 1     212917
 2     201505
 3     157641
 dtype: int64)

In [39]:
df2 = DataFrame([s1, s2], index=['Country', 'Confirmed'])
df2

                 0       1       2        3
Country        USA   Spain   Italy  Germany
Confirmed  1020730  212917  201505   157641

In [40]:
df2.T

   Country Confirmed
0      USA   1020730
1    Spain    212917
2    Italy    201505
3  Germany    157641

In [41]:
df3 = pd.read_clipboard()

In [42]:
df3

    姓名 性别  年龄
0  小帅b  男  18
1   张三  男  66

In [82]:
df4 = DataFrame(df3, columns=['性别', '年龄'])
df4

  性别  年龄
0  男  18
1  男  66

# DataFrame 的访问

In [52]:
df3[0:1]

    姓名 性别  年龄
0  小帅b  男  18

In [61]:
df3.loc[0:]

    姓名 性别  年龄
0  小帅b  男  18
1   张三  男  66

In [77]:
df1

   Country  Confirmed
0      USA    1020730
1    Spain     212917
2    Italy     201505
3  Germany     157641

In [78]:
df1.Country

0        USA
1      Spain
2      Italy
3    Germany
Name: Country, dtype: object

In [80]:
df1.columns

Index(['Country', 'Confirmed'], dtype='object')

In [81]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [88]:
df1.columns.str.upper()

Index(['COUNTRY', 'CONFIRMED'], dtype='object')

In [89]:
df1.columns.str.lower()

Index(['country', 'confirmed'], dtype='object')